tutorials/fluidSolidInteraction/beamInCrossFlow/linearGeometryElasticBeam/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

<<<<<<< HEAD
solver velocityLaplacian; // finite volume solver
motionSolver velocityLaplacian; // finite volume solver

=======
"solver|motionSolver" velocityLaplacian; // finite volume solver
>>>>>>> 5ce5ca18fd737d6fb8e9e88153ad14f2202434ff
//solver laplace; // finite element solver
//motionSolver laplace; // finite element solver

// solver RBFMeshMotionSolver; // radial basis function solver
// motionSolver RBFMeshMotionSolver; // radial basis function solver

diffusivity quadratic inverseDistance (interface);

// Settings for the RBF solver
staticPatches    (top bottom left);
movingPatches    (interface);
fixedPatches     (inlet outlet);
interpolation
{
    function     TPS;
}
coarsening
{
    enabled      no;
}

// ************************************************************************* //
